TaLucGiaHoang/SW-TM4C/TivaWare_C_Series-2.1.4.178/sensorlib/hw_lsm303dlhc.h
//*****************************************************************************
//
// hw_lsm303dlhc.h - Macros used when accessing the ST LSM303DLHC accel/mag
//                   combo
//
// Copyright (c) 2013-2017 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 2.1.4.178 of the Tiva Firmware Development Package.
//
//*****************************************************************************

#ifndef __SENSORLIB_HW_LSM303DLHC_H__
#define __SENSORLIB_HW_LSM303DLHC_H__

//*****************************************************************************
//
// The following are defines for the LSM303DLHC register addresses
//
//*****************************************************************************
#define LSM303DLHC_O_MAG_CRA    0x0         // Magnetometer control
#define LSM303DLHC_O_MAG_CRB    0x01        // Gain configuration
#define LSM303DLHC_O_MAG_MR     0x02        // Mode configuration
#define LSM303DLHC_O_MAG_OUT_X_MSB                                            \
                                0x03        // X-axis MSB
#define LSM303DLHC_O_MAG_OUT_X_LSB                                            \
                                0x04        // X-axis LSB
#define LSM303DLHC_O_MAG_OUT_Y_MSB                                            \
                                0x05        // Y-axis MSB
#define LSM303DLHC_O_MAG_OUT_Y_LSB                                            \
                                0x06        // Y-axis LSB
#define LSM303DLHC_O_MAG_OUT_Z_MSB                                            \
                                0x07        // Z-axis MSB
#define LSM303DLHC_O_MAG_OUT_Z_LSB                                            \
                                0x08        // Z-axis LSB
#define LSM303DLHC_O_MAG_SR     0x09        // Status register
#define LSM303DLHC_O_MAG_IRA    0x0A
#define LSM303DLHC_O_MAG_IRB    0x0B
#define LSM303DLHC_O_MAG_IRC    0x0C
#define LSM303DLHC_O_CTRL1      0x20        // Control 1 - power settings
#define LSM303DLHC_O_CTRL2      0x21        // Control 2
#define LSM303DLHC_O_CTRL3      0x22        // Control 3
#define LSM303DLHC_O_CTRL4      0x23        // Control 4
#define LSM303DLHC_O_CTRL5      0x24        // Control 5
#define LSM303DLHC_O_CTRL6      0x25        // Control 6
#define LSM303DLHC_O_REFERENCE  0x26        // Reference/Datacapture_A
#define LSM303DLHC_O_STATUS     0x27        // Status register
#define LSM303DLHC_O_OUT_X_LSB  0x28        // X-axis LSB
#define LSM303DLHC_O_OUT_X_MSB  0x29        // X-axis MSB
#define LSM303DLHC_O_OUT_Y_LSB  0x2A        // Y-axis LSB
#define LSM303DLHC_O_OUT_Y_MSB  0x2B        // Y-axis MSB
#define LSM303DLHC_O_OUT_Z_LSB  0x2C        // Z-axis LSB
#define LSM303DLHC_O_OUT_Z_MSB  0x2D        // Z-axis MSB
#define LSM303DLHC_O_FIFO_CTRL  0x2E        // FIFO control
#define LSM303DLHC_O_FIFO_SRC   0x2F        // FIFO_SRC register
#define LSM303DLHC_O_INT1_CFG_A 0x30        // INT1 interrupt generation; this
                                            // register only writable after
                                            // boot
#define LSM303DLHC_O_INT1_SRC_A 0x31        // interrupt source register (read
                                            // only)
#define LSM303DLHC_O_MAG_TEMP_OUT_MSB                                         \
                                0x31        // Temperature bits 11-4
#define LSM303DLHC_O_MAG_TEMP_OUT_LSB                                         \
                                0x32        // Temperature bits 3-0
#define LSM303DLHC_O_INT1_THS_A 0x32        // Interrupt 1 threshold
#define LSM303DLHC_O_INT1_DURATION_A                                          \
                                0x33        // INT1 duration register
#define LSM303DLHC_O_INT2_CFG_A 0x34        // INT2 interrupt generation; this
                                            // register only writable after
                                            // boot
#define LSM303DLHC_O_INT2_SRC_A 0x35        // INT2 source register (read only)
#define LSM303DLHC_O_INT2_THS_A 0x36        // INT2 threshold
#define LSM303DLHC_O_INT2_DURATION_A                                          \
                                0x37        // INT2 duration register
#define LSM303DLHC_O_CLICK_CFG_A                                              \
                                0x38        // Click config A register
#define LSM303DLHC_O_CLICK_SRC_A                                              \
                                0x39        // Click source A
#define LSM303DLHC_O_CLICK_THS_A                                              \
                                0x3A        // click-click threshold
#define LSM303DLHC_O_TIME_LIMIT_A                                             \
                                0x3B        // Time Limit A register
#define LSM303DLHC_O_TIME_LATENCY_A                                           \
                                0x3C        // Time Latency A register; 1 LSB =
                                            // 1/ODR; TLA7 through TLA0 define
                                            // the time interval that starts
                                            // after the first click detection
                                            // where the click detection
                                            // procedure is disabled, in cases
                                            // where the device is configured
                                            // for double click detection
#define LSM303DLHC_O_TIME_WINDOW_A                                            \
                                0x3D        // Time Window A register; 1 LSB =
                                            // 1/ODR; TW7 through TW0 define
                                            // the maximum interval of time
                                            // that can elapse after the end of
                                            // the latency interval in which
                                            // the click detection procedure
                                            // can start, in cases where the
                                            // device is configured for double
                                            // click detection

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_MAG_CRA
// register.
//
//*****************************************************************************
#define LSM303DLHC_MAG_CRA_TEMP_M                                             \
                                0x80        // Temperature sensor enable
#define LSM303DLHC_MAG_CRA_TEMP_DIS                                           \
                                0x00
#define LSM303DLHC_MAG_CRA_TEMP_EN                                            \
                                0x80
#define LSM303DLHC_MAG_CRA_DO_M 0x1C        // Data output rate
#define LSM303DLHC_MAG_CRA_DO_0_75HZ                                          \
                                0x00        // 0.75 Hz
#define LSM303DLHC_MAG_CRA_DO_1_5HZ                                           \
                                0x04        // 1.5 Hz
#define LSM303DLHC_MAG_CRA_DO_3_0HZ                                           \
                                0x08        // 3.0 Hz
#define LSM303DLHC_MAG_CRA_DO_7_5HZ                                           \
                                0x0C        // 7.5 Hz
#define LSM303DLHC_MAG_CRA_DO_15HZ                                            \
                                0x10        // 15 Hz
#define LSM303DLHC_MAG_CRA_DO_30HZ                                            \
                                0x14        // 30 Hz
#define LSM303DLHC_MAG_CRA_DO_75HZ                                            \
                                0x18        // 75 Hz
#define LSM303DLHC_MAG_CRA_DO_220HZ                                           \
                                0x1C        // 220 Hz
#define LSM303DLHC_MAG_CRA_DO_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_MAG_CRB
// register.
//
//*****************************************************************************
#define LSM303DLHC_MAG_CRB_GAIN_M                                             \
                                0xE0        // Gain selection
#define LSM303DLHC_MAG_CRB_GAIN_1_3GAUSS                                      \
                                0x20        // +/- 1.3 gauss, 1100 LSB/gauss
#define LSM303DLHC_MAG_CRB_GAIN_1_9GAUSS                                      \
                                0x40        // +/- 1.9 gauss, 855 LSB/gauss
#define LSM303DLHC_MAG_CRB_GAIN_2_5GAUSS                                      \
                                0x60        // +/- 2.5 gauss, 670 LSB/gauss
#define LSM303DLHC_MAG_CRB_GAIN_4_0GAUSS                                      \
                                0x80        // +/- 4.0 gauss, 450 LSB/guass
#define LSM303DLHC_MAG_CRB_GAIN_4_7GAUSS                                      \
                                0xA0        // +/- 4.7 gauss, 400 LSB/gauss
#define LSM303DLHC_MAG_CRB_GAIN_5_6GAUSS                                      \
                                0xC0        // +/- 5.6 gauss, 330 LSB/gauss
#define LSM303DLHC_MAG_CRB_GAIN_8_1GAUSS                                      \
                                0xE0        // +/- 8.1 gauss, 230 LSB/gauss
#define LSM303DLHC_MAG_CRB_GAIN_S                                             \
                                5

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_MAG_MR
// register.
//
//*****************************************************************************
#define LSM303DLHC_MAG_MR_MODE_M                                              \
                                0x3         // Mode select bits
#define LSM303DLHC_MAG_MR_MODE_CONTINUOUS                                     \
                                0x00        // Continuous conversion mode
#define LSM303DLHC_MAG_MR_MODE_SINGLE                                         \
                                0x01        // Single conversion mode
#define LSM303DLHC_MAG_MR_MODE_SLEEP                                          \
                                0x02        // Sleep mode
#define LSM303DLHC_MAG_MR_MODE_S                                              \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_MAG_SR
// register.
//
//*****************************************************************************
#define LSM303DLHC_MAG_SR_LOCK_M                                              \
                                0x02        // Data output register lock; once
                                            // a new set of measurements is
                                            // available, this bit is set when
                                            // the first magnetic field data
                                            // register has been read
#define LSM303DLHC_MAG_SR_LOCK_LOCKED                                         \
                                0x02
#define LSM303DLHC_MAG_SR_DATA_M                                              \
                                0x01        // Data ready bit; this bit is set
                                            // when a new set of measures are
                                            // available
#define LSM303DLHC_MAG_SR_DATA_READ                                           \
                                0x01

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_MAG_IRA
// register.
//
//*****************************************************************************
#define LSM303DLHC_MAG_IRA_CONSTANT_M                                         \
                                0xFF
#define LSM303DLHC_MAG_IRA_CONSTANT_VAL                                       \
                                0x48
#define LSM303DLHC_MAG_IRA_CONSTANT_S                                         \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_MAG_IRB
// register.
//
//*****************************************************************************
#define LSM303DLHC_MAG_IRB_CONSTANT_M                                         \
                                0xFF
#define LSM303DLHC_MAG_IRB_CONSTANT_VAL                                       \
                                0x34
#define LSM303DLHC_MAG_IRB_CONSTANT_S                                         \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_MAG_IRC
// register.
//
//*****************************************************************************
#define LSM303DLHC_MAG_IRC_CONSTANT_M                                         \
                                0xFF
#define LSM303DLHC_MAG_IRC_CONSTANT_VAL                                       \
                                0x33
#define LSM303DLHC_MAG_IRC_CONSTANT_S                                         \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_CTRL1
// register.
//
//*****************************************************************************
#define LSM303DLHC_CTRL1_ODR_M  0xF0        // data rate selection
#define LSM303DLHC_CTRL1_ODR_PD 0x00        // Power-down mode
#define LSM303DLHC_CTRL1_ODR_1HZ                                              \
                                0x10
#define LSM303DLHC_CTRL1_ODR_10HZ                                             \
                                0x20
#define LSM303DLHC_CTRL1_ODR_25HZ                                             \
                                0x30
#define LSM303DLHC_CTRL1_ODR_50HZ                                             \
                                0x40
#define LSM303DLHC_CTRL1_ODR_100HZ                                            \
                                0x50
#define LSM303DLHC_CTRL1_ODR_200HZ                                            \
                                0x60
#define LSM303DLHC_CTRL1_ODR_400HZ                                            \
                                0x70
#define LSM303DLHC_CTRL1_ODR_1620HZ                                           \
                                0x80        // Low power mode
#define LSM303DLHC_CTRL1_ODR_5376HZ                                           \
                                0x90        // 1.344KHz normal, 5.376KHz low
                                            // power
#define LSM303DLHC_CTRL1_POWER_M                                              \
                                0x08        // Power control
#define LSM303DLHC_CTRL1_POWER_LOWPOW                                         \
                                0x00
#define LSM303DLHC_CTRL1_POWER_NORMAL                                         \
                                0x08
#define LSM303DLHC_CTRL1_AXIS_M 0x7         // Axis power control
#define LSM303DLHC_CTRL1_AXIS_Y_EN                                            \
                                0x01        // Y-axis enable
#define LSM303DLHC_CTRL1_AXIS_X_EN                                            \
                                0x02        // X-axis enable
#define LSM303DLHC_CTRL1_AXIS_Z_EN                                            \
                                0x04        // Z-axis enable
#define LSM303DLHC_CTRL1_ODR_S  4
#define LSM303DLHC_CTRL1_AXIS_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_CTRL2
// register.
//
//*****************************************************************************
#define LSM303DLHC_CTRL2_HPMODE_M                                             \
                                0xC0        // high pass filter mode selection
#define LSM303DLHC_CTRL2_HPMODE_NORMAL_RESET                                  \
                                0x00        // normal mode (reset reading
                                            // HP_RESET_FILTER)
#define LSM303DLHC_CTRL2_HPMODE_REFERENCE                                     \
                                0x40        // reference signal for filtering
#define LSM303DLHC_CTRL2_HPMODE_NORMAL                                        \
                                0x80        // Normal mode
#define LSM303DLHC_CTRL2_HPMODE_AUTORESET                                     \
                                0xC0        // autoreset on interrupt event
#define LSM303DLHC_CTRL2_HPCUTOFF_M                                           \
                                0x30        // high pass filter cut-off
                                            // frequency selection
#define LSM303DLHC_CTRL2_FDS_M  0x08        // Filtered data selection
#define LSM303DLHC_CTRL2_FDS_BYPASSED                                         \
                                0x00
#define LSM303DLHC_CTRL2_FDS_FILTERED                                         \
                                0x08
#define LSM303DLHC_CTRL2_HPCLICK_M                                            \
                                0x04        // High pass filter enabled for
                                            // CLICK function
#define LSM303DLHC_CTRL2_HPCLICK_BYPASSED                                     \
                                0x00
#define LSM303DLHC_CTRL2_HPCLICK_FILTERED                                     \
                                0x04
#define LSM303DLHC_CTRL2_HPIS2_M                                              \
                                0x02        // High pass filter enabled for AOI
                                            // function on Interrupt 2
#define LSM303DLHC_CTRL2_HPIS2_BYPASSED                                       \
                                0x00
#define LSM303DLHC_CTRL2_HPIS2_FILTERED                                       \
                                0x02
#define LSM303DLHC_CTRL2_HPIS1_M                                              \
                                0x01        // High pass filter enabled for AOI
                                            // function on Interrupt 1
#define LSM303DLHC_CTRL2_HPIS1_BYPASSED                                       \
                                0x00
#define LSM303DLHC_CTRL2_HPIS1_FILTERED                                       \
                                0x01
#define LSM303DLHC_CTRL2_HPMODE_S                                             \
                                6
#define LSM303DLHC_CTRL2_HPCUTOFF_S                                           \
                                4

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_CTRL3
// register.
//
//*****************************************************************************
#define LSM303DLHC_CTRL3_I1CLICK_M                                            \
                                0x80        // CLICK on INT1
#define LSM303DLHC_CTRL3_I1CLICK_DIS                                          \
                                0x00
#define LSM303DLHC_CTRL3_I1CLICK_EN                                           \
                                0x80
#define LSM303DLHC_CTRL3_I1AOI1_M                                             \
                                0x40        // AOI1 on INT1
#define LSM303DLHC_CTRL3_I1AOI1_DIS                                           \
                                0x00
#define LSM303DLHC_CTRL3_I1AOI1_EN                                            \
                                0x40
#define LSM303DLHC_CTRL3_I1AOI2_M                                             \
                                0x20        // AOI2 on INT1
#define LSM303DLHC_CTRL3_I1AOI2_DIS                                           \
                                0x00
#define LSM303DLHC_CTRL3_I1AOI2_EN                                            \
                                0x20
#define LSM303DLHC_CTRL3_I1DRDY1_M                                            \
                                0x10        // DRDY1 on INT1
#define LSM303DLHC_CTRL3_I1DRDY1_DIS                                          \
                                0x00
#define LSM303DLHC_CTRL3_I1DRDY1_EN                                           \
                                0x10
#define LSM303DLHC_CTRL3_I1DRDY2_M                                            \
                                0x08        // DRDY2 on INT1
#define LSM303DLHC_CTRL3_I1DRDY2_DIS                                          \
                                0x00
#define LSM303DLHC_CTRL3_I1DRDY2_EN                                           \
                                0x08
#define LSM303DLHC_CTRL3_I1WTM_M                                              \
                                0x04        // FIFO watermark interrupt on INT1
#define LSM303DLHC_CTRL3_I1WTM_DIS                                            \
                                0x00
#define LSM303DLHC_CTRL3_I1WTM_EN                                             \
                                0x04
#define LSM303DLHC_CTRL3_I1OVERRUN_M                                          \
                                0x02        // FIFO overrun interrupt on INT1
#define LSM303DLHC_CTRL3_I1OVERRUN_DIS                                        \
                                0x00
#define LSM303DLHC_CTRL3_I1OVERRUN_EN                                         \
                                0x02

