TaLucGiaHoang/SW-TM4C/TivaWare_C_Series-2.1.4.178/sensorlib/hw_lsm303dlhc.h
//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_CTRL4
// register.
//
//*****************************************************************************
#define LSM303DLHC_CTRL4_BDU_M  0x80        // Block data update; default
                                            // value: 0 (0: continuous update;
                                            // 1: output registers not updated
                                            // until MSB and LSB reading)
#define LSM303DLHC_CTRL4_BDU_CONTINUOUS                                       \
                                0x00
#define LSM303DLHC_CTRL4_BDU_MSBLSB                                           \
                                0x80
#define LSM303DLHC_CTRL4_ENDIAN_M                                             \
                                0x40        // Endian selection
#define LSM303DLHC_CTRL4_ENDIAN_LITTLE                                        \
                                0x00
#define LSM303DLHC_CTRL4_ENDIAN_BIG                                           \
                                0x40
#define LSM303DLHC_CTRL4_FS_M   0x30        // full scale selection; default
                                            // value: 0
#define LSM303DLHC_CTRL4_FS_2G  0x00
#define LSM303DLHC_CTRL4_FS_4G  0x10
#define LSM303DLHC_CTRL4_FS_8G  0x20
#define LSM303DLHC_CTRL4_FS_16G 0x30
#define LSM303DLHC_CTRL4_RESOLUTION_M                                         \
                                0x08        // resolution output mode
#define LSM303DLHC_CTRL4_RESOLUTION_LOW                                       \
                                0x00
#define LSM303DLHC_CTRL4_RESOLUTION_HIGH                                      \
                                0x08
#define LSM303DLHC_CTRL4_SIM_M  0x01        // SPI Serial Interface Mode
                                            // selection (default = 0, 4-wire)
#define LSM303DLHC_CTRL4_SIM_4WIRE                                            \
                                0x00
#define LSM303DLHC_CTRL4_SIM_3WIRE                                            \
                                0x01
#define LSM303DLHC_CTRL4_FS_S   4

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_CTRL5
// register.
//
//*****************************************************************************
#define LSM303DLHC_CTRL5_REBOOTCTL_M                                          \
                                0x80        // Reboot memory conent
#define LSM303DLHC_CTRL5_REBOOTCTL_NORMAL                                     \
                                0x00
#define LSM303DLHC_CTRL5_REBOOTCTL_REBOOT                                     \
                                0x80
#define LSM303DLHC_CTRL5_FIFO_M 0x40        // FIFO enable
#define LSM303DLHC_CTRL5_FIFO_DIS                                             \
                                0x00
#define LSM303DLHC_CTRL5_FIFO_EN                                              \
                                0x40
#define LSM303DLHC_CTRL5_LIR_INT1_M                                           \
                                0x08        // Latch interrupt on INT1
#define LSM303DLHC_CTRL5_LIR_INT1_DIS                                         \
                                0x00
#define LSM303DLHC_CTRL5_LIR_INT1_EN                                          \
                                0x08
#define LSM303DLHC_CTRL5_D4D_INT1_M                                           \
                                0x04        // 4D Int enable on INT1
#define LSM303DLHC_CTRL5_D4D_INT1_DIS                                         \
                                0x00
#define LSM303DLHC_CTRL5_D4D_INT1_EN                                          \
                                0x04
#define LSM303DLHC_CTRL5_LIR_INT2_M                                           \
                                0x02        // Latch interrupt request on
                                            // INT2_SRC register, with INT2_SRC
                                            // register cleared by reading
                                            // INT2_SRC itself; default value:
                                            // 0
#define LSM303DLHC_CTRL5_LIR_INT2_DIS                                         \
                                0x00
#define LSM303DLHC_CTRL5_LIR_INT2_EN                                          \
                                0x02
#define LSM303DLHC_CTRL5_D4D_INT2_M                                           \
                                0x01        // 4D enable: 4D detection is
                                            // enabled on INT2 when 6D bit on
                                            // INT2_CFG is set to 1
#define LSM303DLHC_CTRL5_D4D_INT2_DIS                                         \
                                0x00
#define LSM303DLHC_CTRL5_D4D_INT2_EN                                          \
                                0x01

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_CTRL6
// register.
//
//*****************************************************************************
#define LSM303DLHC_CTRL6_I2_CLICK_M                                           \
                                0x80        // CLICK interrupt on PAD2
#define LSM303DLHC_CTRL6_I2_CLICK_DIS                                         \
                                0x00
#define LSM303DLHC_CTRL6_I2_CLICK_EN                                          \
                                0x80
#define LSM303DLHC_CTRL6_I2_INT1_M                                            \
                                0x40        // Interrupt 1 on PAD2; default
                                            // value 0
#define LSM303DLHC_CTRL6_I2_INT1_DIS                                          \
                                0x00
#define LSM303DLHC_CTRL6_I2_INT1_EN                                           \
                                0x40
#define LSM303DLHC_CTRL6_I2_INT2_M                                            \
                                0x20        // Interrupt 2 on PAD2; default
                                            // value 0
#define LSM303DLHC_CTRL6_I2_INT2_DIS                                          \
                                0x00
#define LSM303DLHC_CTRL6_I2_INT2_EN                                           \
                                0x20
#define LSM303DLHC_CTRL6_BOOT_I2_M                                            \
                                0x10        // Reboot memory content on PAD2;
                                            // default value: 0
#define LSM303DLHC_CTRL6_BOOT_I2_DIS                                          \
                                0x00
#define LSM303DLHC_CTRL6_BOOT_I2_EN                                           \
                                0x10
#define LSM303DLHC_CTRL6_P2_ACT_M                                             \
                                0x08        // active function status on PAD2
#define LSM303DLHC_CTRL6_P2_ACT_DIS                                           \
                                0x00
#define LSM303DLHC_CTRL6_P2_ACT_EN                                            \
                                0x08
#define LSM303DLHC_CTRL6_H_LACTIVE_M                                          \
                                0x02        // interrupt active configuration
                                            // on INT; default value 0 (0:
                                            // high; 1:low)
#define LSM303DLHC_CTRL6_H_LACTIVE_HI                                         \
                                0x00
#define LSM303DLHC_CTRL6_H_LACTIVE_LOW                                        \
                                0x02

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_STATUS
// register.
//
//*****************************************************************************
#define LSM303DLHC_STATUS_OR_M  0xF0        // Axis data overrun
#define LSM303DLHC_STATUS_OR_X  0x10        // X-axis data overrun
#define LSM303DLHC_STATUS_OR_Y  0x20        // Y-axis data overrun
#define LSM303DLHC_STATUS_OR_Z  0x40        // Z-axis data overrun
#define LSM303DLHC_STATUS_OR_ZYX                                              \
                                0x80        // X, Y, and X data overrun
#define LSM303DLHC_STATUS_DA_M  0xF         // Axis data available
#define LSM303DLHC_STATUS_DA_X  0x01        // X-axis data available
#define LSM303DLHC_STATUS_DA_Y  0x02        // Y-axis data available
#define LSM303DLHC_STATUS_DA_Z  0x04        // Z-axis data available
#define LSM303DLHC_STATUS_DA_ZYX                                              \
                                0x08        // X, Y, and X data available
#define LSM303DLHC_STATUS_OR_S  4
#define LSM303DLHC_STATUS_DA_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_FIFO_CTRL
// register.
//
//*****************************************************************************
#define LSM303DLHC_FIFO_CTRL_TR_M                                             \
                                0x20
#define LSM303DLHC_FIFO_CTRL_TR_INT1                                          \
                                0x00
#define LSM303DLHC_FIFO_CTRL_TR_INT2                                          \
                                0x20
#define LSM303DLHC_FIFO_CTRL_THRESH_M                                         \
                                0x1F        // FIFO Threshold setting
#define LSM303DLHC_FIFO_CTRL_MODE_M                                           \
                                0xC         // FIFO mode setting
#define LSM303DLHC_FIFO_CTRL_MODE_BYPASS                                      \
                                0x00        // Bypass mode
#define LSM303DLHC_FIFO_CTRL_MODE_FIFO                                        \
                                0x40        // FIFO mode
#define LSM303DLHC_FIFO_CTRL_MODE_STREAM                                      \
                                0x80        // Stream mode
#define LSM303DLHC_FIFO_CTRL_MODE_TRIGGER                                     \
                                0xC0        // Trigger mode
#define LSM303DLHC_FIFO_CTRL_MODE_S                                           \
                                6
#define LSM303DLHC_FIFO_CTRL_THRESH_S                                         \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_FIFO_SRC
// register.
//
//*****************************************************************************
#define LSM303DLHC_FIFO_SRC_FTH_M                                             \
                                0x80        // FIFO threshold is greater than
                                            // or equal to level or less than
                                            // level
#define LSM303DLHC_FIFO_SRC_FTH_LT                                            \
                                0x00
#define LSM303DLHC_FIFO_SRC_FTH_GEQ                                           \
                                0x80
#define LSM303DLHC_FIFO_SRC_OVRN_M                                            \
                                0x40        // overrun status bit
#define LSM303DLHC_FIFO_SRC_OVRN_FILLED                                       \
                                0x40
#define LSM303DLHC_FIFO_SRC_EMPTY_M                                           \
                                0x20        // FIFO empty
#define LSM303DLHC_FIFO_SRC_EMPTY_EMPTY                                       \
                                0x20
#define LSM303DLHC_FIFO_SRC_STORE_SAMPLES_M                                   \
                                0x1F        // FIFO stored data level of the
                                            // unread samples
#define LSM303DLHC_FIFO_SRC_STORE_SAMPLES_S                                   \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_INT1_CFG_A
// register.
//
//*****************************************************************************
#define LSM303DLHC_INT1_CFG_A_ANDOR_M                                         \
                                0x80        // AND/OR combination of Interrupt
                                            // events; default value: 0
#define LSM303DLHC_INT1_CFG_A_ANDOR_OR                                        \
                                0x00
#define LSM303DLHC_INT1_CFG_A_ANDOR_AND                                       \
                                0x80
#define LSM303DLHC_INT1_CFG_A_6D_M                                            \
                                0x40        // 6-direction function enabled
#define LSM303DLHC_INT1_CFG_A_6D_EN                                           \
                                0x40
#define LSM303DLHC_INT1_CFG_A_ZHI_M                                           \
                                0x20        // enable interrupt generation on
                                            // Z-hi event
#define LSM303DLHC_INT1_CFG_A_ZHI_EN                                          \
                                0x20
#define LSM303DLHC_INT1_CFG_A_ZUPE_M                                          \
                                0x20        // enable interrupt generation on
                                            // Z-hi event
#define LSM303DLHC_INT1_CFG_A_ZUPE_EN                                         \
                                0x20
#define LSM303DLHC_INT1_CFG_A_ZDOWNE_M                                        \
                                0x10        // enable interrupt generation on
                                            // Z-low event
#define LSM303DLHC_INT1_CFG_A_ZDOWNE_EN                                       \
                                0x10
#define LSM303DLHC_INT1_CFG_A_ZLI_M                                           \
                                0x10        // enable interrupt generation on
                                            // Z-low event
#define LSM303DLHC_INT1_CFG_A_ZLI_EN                                          \
                                0x10
#define LSM303DLHC_INT1_CFG_A_YUPE_M                                          \
                                0x08        // enable interrupt generation on
                                            // Y-hi event
#define LSM303DLHC_INT1_CFG_A_YUPE_EN                                         \
                                0x08
#define LSM303DLHC_INT1_CFG_A_YHI_M                                           \
                                0x08        // enable interrupt generation on
                                            // Y-hi event
#define LSM303DLHC_INT1_CFG_A_YHI_EN                                          \
                                0x08
#define LSM303DLHC_INT1_CFG_A_YDOWNE_M                                        \
                                0x04        // enable interrupt generation on
                                            // Y-low event
#define LSM303DLHC_INT1_CFG_A_YDOWNE_EN                                       \
                                0x04
#define LSM303DLHC_INT1_CFG_A_YLI_M                                           \
                                0x04        // enable interrupt generation on
                                            // Y-low event
#define LSM303DLHC_INT1_CFG_A_YLI_EN                                          \
                                0x04
#define LSM303DLHC_INT1_CFG_A_XHI_M                                           \
                                0x02        // enable interrupt generation on
                                            // X-hi event
#define LSM303DLHC_INT1_CFG_A_XHI_EN                                          \
                                0x02
#define LSM303DLHC_INT1_CFG_A_XUPE_M                                          \
                                0x02        // enable interrupt generation on
                                            // X-hi event
#define LSM303DLHC_INT1_CFG_A_XUPE_EN                                         \
                                0x02
#define LSM303DLHC_INT1_CFG_A_XLI_M                                           \
                                0x01        // enable interrupt generation on
                                            // X-low event
#define LSM303DLHC_INT1_CFG_A_XLI_EN                                          \
                                0x01
#define LSM303DLHC_INT1_CFG_A_XDOWNE_M                                        \
                                0x01        // enable interrupt generation on
                                            // X-low event
#define LSM303DLHC_INT1_CFG_A_XDOWNE_EN                                       \
                                0x01

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_INT1_SRC_A
// register.
//
//*****************************************************************************
#define LSM303DLHC_INT1_SRC_A_ZERO_M                                          \
                                0x80        // This bit must be zero
#define LSM303DLHC_INT1_SRC_A_ZERO_ZERO                                       \
                                0x00
#define LSM303DLHC_INT1_SRC_A_ZERO_INVALID                                    \
                                0x80
#define LSM303DLHC_INT1_SRC_A_IA_M                                            \
                                0x40        // interrupt active
#define LSM303DLHC_INT1_SRC_A_IA_ACTIVE                                       \
                                0x40
#define LSM303DLHC_INT1_SRC_A_ZH_M                                            \
                                0x20        // Z-Hi event occurred
#define LSM303DLHC_INT1_SRC_A_ZH_OCCURRED                                     \
                                0x20
#define LSM303DLHC_INT1_SRC_A_ZL_M                                            \
                                0x10        // Z-Low event occurred
#define LSM303DLHC_INT1_SRC_A_ZL_OCCURRED                                     \
                                0x10
#define LSM303DLHC_INT1_SRC_A_YH_M                                            \
                                0x08        // Y-Hi event occurred
#define LSM303DLHC_INT1_SRC_A_YH_OCCURRED                                     \
                                0x08
#define LSM303DLHC_INT1_SRC_A_YL_M                                            \
                                0x04        // Y-Low event occurred
#define LSM303DLHC_INT1_SRC_A_YL_OCCURRED                                     \
                                0x04
#define LSM303DLHC_INT1_SRC_A_XH_M                                            \
                                0x02        // X-Hi event occurred
#define LSM303DLHC_INT1_SRC_A_XH_OCCURRED                                     \
                                0x02
#define LSM303DLHC_INT1_SRC_A_XL_M                                            \
                                0x01        // X-Low event occurred
#define LSM303DLHC_INT1_SRC_A_XL_OCCURRED                                     \
                                0x01

//*****************************************************************************
//
// The following are defines for the bit fields in the
// LSM303DLHC_O_MAG_TEMP_OUT_MSB register.
//
//*****************************************************************************
#define LSM303DLHC_MAG_TEMP_OUT_MSB_MSB_M                                     \
                                0xFF
#define LSM303DLHC_MAG_TEMP_OUT_MSB_MSB_S                                     \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// LSM303DLHC_O_MAG_TEMP_OUT_LSB register.
//
//*****************************************************************************
#define LSM303DLHC_MAG_TEMP_OUT_LSB_LSB_M                                     \
                                0xF0
#define LSM303DLHC_MAG_TEMP_OUT_LSB_LSB_S                                     \
                                4

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303DLHC_O_INT1_THS_A
// register.
//
//*****************************************************************************
#define LSM303DLHC_INT1_THS_A_ZERO_M                                          \
                                0x80        // This bit must be zero
#define LSM303DLHC_INT1_THS_A_ZERO_ZERO                                       \
                                0x00
#define LSM303DLHC_INT1_THS_A_ZERO_INVALID                                    \
                                0x80
#define LSM303DLHC_INT1_THS_A_THS_M                                           \
                                0x7F        // THS[6-0] Interrupt threshold,
                                            // default 0x0
#define LSM303DLHC_INT1_THS_A_THS_S                                           \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// LSM303DLHC_O_INT1_DURATION_A register.
//
//*****************************************************************************
#define LSM303DLHC_INT1_DURATION_A_ZERO_M                                     \
                                0x80        // This bit must be zero
#define LSM303DLHC_INT1_DURATION_A_ZERO_ZERO                                  \
                                0x00
#define LSM303DLHC_INT1_DURATION_A_ZERO_INVALID                               \
                                0x80
#define LSM303DLHC_INT1_DURATION_A_DURATION_M                                 \
                                0x7F        // Duration D[6-0]
#define LSM303DLHC_INT1_DURATION_A_DURATION_S                                 \
                                0

